Tekla.Structures.Model.HierarchicDefinition
The HierarchicDefinition class defines a hierarchy structure. This hierarchy structure can
be instantiated and extended by hierarchical objects.
Tekla.Structures.Model.HierarchicObject
using Tekla.Structures.Model;
public class Example
{
public void Example1()
{
HierarchicDefinition scenarioDefinition = new HierarchicDefinition();
scenarioDefinition.Name = "Scenario type";
scenarioDefinition.HierarchyType = HierarchicDefinitionTypeEnum.DOT_HIERARCHIC_TASK_SCENARIO;
scenarioDefinition.Insert();
}
}

Tekla.Structures.Model.HierarchicDefinition.MAX_HIERARCHIC_LIST_OBJECTS
Maximum number of hierarchical definition resources.

Tekla.Structures.Model.HierarchicDefinition.Name
The name of the hierarchical definition.

Tekla.Structures.Model.HierarchicDefinition.CustomType
The custom type of the hierarchical definition.

Tekla.Structures.Model.HierarchicDefinition.HierarchyType
The type of the hierarchical definition.
Tekla.Structures.Model.HierarchicDefinitionTypeEnum

Tekla.Structures.Model.HierarchicDefinition.Father
The father of the hierarchical definition.

Tekla.Structures.Model.HierarchicDefinition.HierarchyIdentifier
The GUID of the hierarchical definition.

Tekla.Structures.Model.HierarchicDefinition.Drawable
Defines whether the hierarchical definition is a drawable area in the model.

Tekla.Structures.Model.HierarchicDefinition.HierarchicChildren
An array list that contains the hierarchical definition's children.

Tekla.Structures.Model.HierarchicDefinition.#ctor
Creates a new hierarchical definition instance.

Tekla.Structures.Model.HierarchicDefinition.#ctor(Tekla.Structures.Identifier)
Instantiates a hierarchical definition with a known identifier. The instantiation has to be done
before the hierarchical definition instance can be selected.
ID: The identifier of an existing hierarchical definition.
using Tekla.Structures.Model;
using Tekla.Structures;
public class Example
{
public void Example1()
{
Identifier id = new Identifier(357);
HierarchicDefinition hierarchicalDefinition = new HierarchicDefinition(id);
}
}

Tekla.Structures.Model.HierarchicDefinition.AddObjects(System.Collections.ArrayList)
Associates hierarchical objects with the hierarchical definition.
Fails if the hierarchical definition doesn't exist in the model.
Objects: The hierarchical objects.
Returns: True if successful.

Tekla.Structures.Model.HierarchicDefinition.RemoveObjects(System.Collections.ArrayList)
Removes associations to the given list of hierarchical objects.
Fails if the hierarchical definition doesn't exist in the model.
Objects: The hierarchical objects.
Returns: True if successful.

Tekla.Structures.Model.HierarchicDefinition.Insert
Inserts the hierarchical definition instance in the model.
Returns: True if the insertion was successful.

Tekla.Structures.Model.HierarchicDefinition.Select
Selects the hierarchical definition instance from the model. The ID must be set.
Returns: True if the selection was successful.

Tekla.Structures.Model.HierarchicDefinition.Modify
Modifies the hierarchical definition instance in the model. The ID must be set.
Returns: True if the modification was successful.

Tekla.Structures.Model.HierarchicDefinition.Delete
Deletes the hierarchical definition instance from the model. The ID must be set.
Returns: True if the deletion was successful.